Repository: WillisXChen/cisco-foundation-sec-mac
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: hi, th

source: View Hardware History
hi: हार्डवेयर इतिहास देखें
th: ดูประวัติฮาร์ดแวร์

source: ### ⚙️ System Initializing...
hi: ### ⚙️ सिस्टम इनिशियलाइज़ हो रहा है...
th: ### ⚙️ กำลังเริ่มระบบ...

source: ### ⚙️ Loading ({step}/4): {name}...
hi: ### ⚙️ लोड हो रहा है ({step}/4): {name} लोड किया जा रहा है...
th: ### ⚙️ กำลังโหลด ({step}/4): กำลังโหลด {name}...

source: ### ⚙️ Loading (3/4): Initializing Vector Database...
hi: ### ⚙️ लोड हो रहा है (3/4): वेक्टर डेटाबेस इनिशियलाइज़ हो रहा है...
th: ### ⚙️ กำลังโหลด (3/4): กำลังเริ่มฐานข้อมูลเวกเตอร์...

source: ### ⚙️ Loading (4/4): Syncing Knowledge Base...
hi: ### ⚙️ लोड हो रहा है (4/4): नॉलेज बेस सिंक हो रहा है...
th: ### ⚙️ กำลังโหลด (4/4): กำลังซิงค์ฐานความรู้...

source: ### ✅ System Ready! 🛡️ **Foundation-Sec-8B Security Assistant** Started.
hi: ### ✅ सिस्टम तैयार है! 🛡️ **Foundation-Sec-8B सुरक्षा सहायक** शुरू हो गया है।
th: ### ✅ ระบบพร้อมแล้ว! 🛡️ **Foundation-Sec-8B Security Assistant** เริ่มต้นขึ้นแล้ว

source: ### ❌ Initialization Failed: `{e}`
hi: ### ❌ इनिशियलाइज़ेशन विफल: `{e}`
th: ### ❌ เริ่มต้นระบบไม่สำเร็จ: `{e}`

source: ### 🧠 Generated by `{author}` ---
hi: ### 🧠 `{author}` द्वारा तैयार किया गया ---
th: ### 🧠 สร้างโดย `{author}` ---

source: > 🔄 *Translating...*
hi: > 🔄 *अनुवाद हो रहा है...*
th: > 🔄 *กำลังแปล...*

source: ### 🧠 Translated by `{author}` ---
hi: ### 🧠 `{author}` द्वारा अनुवादित ---
th: ### 🧠 แปลโดย `{author}` ---

source: In
hi: इनपुट
th: เข้า

source: Out
hi: आउटपुट
th: ออก

source: 📊 Fetching historical data from InfluxDB...
hi: 📊 InfluxDB से ऐतिहासिक डेटा प्राप्त किया जा रहा है...
th: 📊 กำลังดึงข้อมูลประวัติจาก InfluxDB...

source: ⚠️ Database not connected, please try again later.
hi: ⚠️ डेटाबेस जुड़ा नहीं है, कृपया बाद में पुनः प्रयास करें।
th: ⚠️ ไม่ได้เชื่อมต่อฐานข้อมูล โปรดลองอีกครั้งในภายหลัง

source: ⚠️ Not enough historical data collected yet.
hi: ⚠️ अभी तक पर्याप्त ऐतिहासिक डेटा एकत्र नहीं हुआ है।
th: ⚠️ ยังรวบรวมข้อมูลประวัติไม่เพียงพอ

source: Usage (%)
hi: उपयोग (%)
th: การใช้งาน (%)

source: Power (Watt)
hi: पावर (वॉट)
th: กำลังไฟฟ้า (วัตต์)

source: Last 15 Minutes Trend
hi: पिछले 15 मिनट का रुझान
th: แนวโน้มใน 15 นาทีที่ผ่านมา

source: ✅ **History Chart Generated**
hi: ✅ **ऐतिहासिक चार्ट तैयार किया गया**
th: ✅ **สร้างแผนภูมิประวัติแล้ว**

source: History Monitor
hi: इतिहास मॉनिटर
th: ตัวตรวจสอบประวัติ

source: ❌ Data Read Error: {e}
hi: ❌ डेटा पढ़ने में त्रुटि: {e}
th: ❌ ข้อผิดพลาดในการอ่านข้อมูล: {e}

source: History
hi: इतिहास
th: ประวัติ

source: PerfMon
hi: प्रदर्शन मॉनिटर
th: ตัวตรวจสอบประสิทธิภาพ

source: Type your message here...
hi: अपना संदेश यहाँ लिखें...
th: พิมพ์ข้อความของคุณที่นี่...

source: Help
hi: सहायता
th: ช่วยเหลือ

source: New Chat
hi: नई चैट
th: แชทใหม่

source: Chat Settings
hi: चैट सेटिंग्स
th: การตั้งค่าแชท

source: LLMs can make mistakes. Please verify important info.
hi: LLM गलतियाँ कर सकते हैं। कृपया महत्वपूर्ण जानकारी सत्यापित करें।
th: LLM อาจทำข้อผิดพลาดได้ โปรดตรวจสอบข้อมูลที่สำคัญ
